W6D3-D4/first_routes_project/app/controllers/artworks_controller.rb

SELECT "artworks".* FROM "artworks" WHERE "artworks"."artist_id" = $1  [["artist_id", 7]]
SELECT "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."viewer_id" = $1  [["viewer_id", 7]]
---
    def index
        @artworks = []
        if params.has_key?(:user_id)
            @artworks << Artwork.where(artist_id: params[:user_id])
            @artworks << ArtworkShare.where(viewer_id: params[:user_id])

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def show
        render json: Artwork.find(params[:id])