W6D3-D4/first_routes_project/app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."commenter_id" = $1  [["commenter_id", 6]]
SELECT "comments".* FROM "comments" WHERE "comments"."artwork_id" = $1  [["artwork_id", 3]]
---
    def index

        @comments = []
        if params.has_key?(:user_id)
            @comments << Comment.where(commenter_id: params[:user_id])
        elsif params.has_key?(:artwork_id)
            @comments << Comment.where(artwork_id: params[:artwork_id])