W6D3-D4/first_routes_project/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
    def index
        # debugger
        @users = User.all

INSERT INTO "users" ("username", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["username", "''postman'"], ["created_at", "2020-08-13 17:51:52.571050"], ["updated_at", "2020-08-13 17:51:52.571050"]]
---
    def create
        @user = User.new(user_params)
        if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["username", "BrradLarson2"], ["updated_at", "2020-08-13 17:53:51.779327"], ["id", 6]]
---
    def update
        @user = User.find(params[:id])
        if @user.update(user_params)