W7D2/MovieApp/app/controllers/albums_controller.rb

SELECT "bands".* FROM "bands"
---
    def new
        @bands = Band.all

SELECT "bands".* FROM "bands"
INSERT INTO "albums" ("band_id", "title", "year", "album_type", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["band_id", 1], ["title", "Long Live A$AP"], ["year", 2013], ["album_type", "Studio"], ["created_at", "2020-08-18 20:23:36.526279"], ["updated_at", "2020-08-18 20:23:36.526279"]]
---
    def create
        @bands = Band.all
        @album = Album.new(album_params)
        if @album.save

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def show
        @album = Album.find_by(id: params[:id])

SELECT "bands".* FROM "bands"
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
---
    def edit
        @bands = Band.all
        @album = Album.find_by(id: params[:id])

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
UPDATE "albums" SET "band_id" = $1, "updated_at" = $2 WHERE "albums"."id" = $3  [["band_id", 1], ["updated_at", "2020-08-25 02:25:41.618123"], ["id", 8]]
---
    def update
        @album = Album.find_by(id: params[:id])
        if @album.update_attributes(album_params)