W7D2/MovieApp/app/controllers/bands_controller.rb

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
    def show
        @band = Band.find_by(id: params[:id])

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
    def edit
        @band = Band.find_by(id: params[:id])

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "bands" SET "name" = $1, "updated_at" = $2 WHERE "bands"."id" = $3  [["name", "Roxette"], ["updated_at", "2020-08-18 19:47:54.915341"], ["id", 4]]
---
    def update
        @band = Band.find_by(id: params[:id])
        if @band.update_attributes(band_params)