W6D3/first_routes/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
    def index
        # debugger
        @users = User.all

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "email" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "'David'"], ["email", "'strikers@gmail.com'"], ["updated_at", "2020-08-12 20:57:36.105585"], ["id", 3]]
---
    def update
        @user = User.find(params[:id])
        if @user.update(user_params)